using System.Drawing.Printing;
using System.Runtime.CompilerServices;


namespace nameapp
{
    public partial class Form1 : Form

    {
        bool kra = false;



        public Form1()
        {
            InitializeComponent();
            if (richTextBox1.Text == " ")
            {
                string a = "";
                richTextBox1.AppendText(a);
            }
        }

        private void getParagraph_Click(object sender, EventArgs e)
        {
            richTextBox1.Clear();

            string inputWord = nameInput.Text.ToUpper();
            nameInput.Clear();

            foreach (char letter in inputWord)
            {
                string Paragraph = getLetter(letter);
                richTextBox1.AppendText(Paragraph + Environment.NewLine + Environment.NewLine);
            }

            checkBox1.Enabled = true;
            checkBox1.Checked = false;

        }

        private String getLetter(char letter)
        {
            switch (letter)
            {
                case 'א':
                    return "אשרי תמימי דרך ההלכים בתורת ה'\nאשרי נצרי עדתיו בכל לב ידרשוהו\n" +
                        "אף לא פעלו עולה בדרכיו הלכו \nאתה צויתה פקדיך לשמר מאד " +
                        "\nאחלי יכנו דרכי לשמר חקיך \nאז לא אבוש בהביטי אל כל מצותיך \nאודך בישר לבב בלמדי משפטי צדקך" +
                        " \nאת חקיך אשמר אל תעזבני עד מאד ";

                case 'ב':
                    return "במה יזכה נער את ארחו לשמר כדברך\nבכל לבי דרשתיך אל תשגני ממצותיך\nבלבי צפנתי אמרתך למען לא אחטא לך\n" +
                        "ברוך אתה ה' למדני חקיך\nבשפתי ספרתי כל משפטי פיך\nבדרך עדותיך ששתי כעל כל הון\nבפקדיך אשיחה" +
                        " ואביטה ארחתיך\nבחקתיך אשתעשע לא אשכח דברך";

                case 'ג':
                    return "גמל על עבדך אחיה ואשמרה דברך\nגל עיני ואביטה נפלאות מתורתך \n" +
                        "גר אנכי בארץ אל תסתר ממני מצותיך \nגרסה נפשי לתאבה אל משפטיך בכל עת \n" +
                        "גערת זדים ארורים השגים ממצותיך \nגל מעלי חרפה ובוז כי עדתיך נצרתי \nגם ישבו שרים בי נדברו עבדך " +
                        "ישיח בחקיך \nגם עדתיך שעשעי אנשי עצתי ";

                case 'ד':
                    return "דבקה לעפר נפשי חיני כדברך \nדרכי ספרתי ותענני למדני חקיך \nדרך פקודיך הבינני ואשיחה בנפלאותיך" +
                        " \nדלפה נפשי מתוגה קימני כדברך \nדרך שקר הסר ממני ותורתך חנני \n" +
                        "דרך אמונה בחרתי משפטיך שויתי \nדבקתי בעדותיך ה' אל תבישני \nדרך מצותיך ארוץ כי תרחיב לבי";

                case 'ה':
                    return "הורני ה' דרך חקיך ואצרנה עקב \nהבינני ואצרה תורתך ואשמרנה בכל לב \n" +
                        "הדריכני בנתיב מצותיך כי בו חפצתי \nהט לבי אל עדותיך ואל אל בצע \n" +
                        "העבר עיני מראות שוא בדרכך חיני \nהקם לעבדך אמרתך אשר ליראתך \n" +
                        "העבר חרפתי אשר יגרתי כי משפטיך טובים \nהנה תאבתי לפקדיך בצדקתך חיני ";

                case 'ו':
                    return "ויבאני חסדך ה' תשועתך כאמרתך \nואענה חרפי דבר כי בטחתי בדברך \n" +
                        "ואל תצל מפי דבר אמת עד מאד כי למשפטך יחלתי \nואשמרה תורתך תמיד לעולם ועד \nואתהלכה ברחבה כי פקדיך דרשתי " +
                        "\nואדברה בעדתיך נגד מלכים ולא אבוש \nואשתעשע במצותיך אשר אהבתי \nואשא כפי אל מצותיך אשר אהבתי ואשיחה בחקיך ";

                case 'ז':
                    return "זכר דבר לעבדך על אשר יחלתני \nזאת נחמתי בעניי כי אמרתך חיתני \nזדים הליצני עד מאד מתורתך לא נטיתי " +
                        "\nזכרתי משפטיך מעולם ה' ואתנחם \nזלעפה אחזתני מרשעים עזבי תורתך \nזמרות היו לי חקיך בבית מגורי " +
                        "\nזכרתי בלילה שמך ה' ואשמרה תורתך \nזאת היתה לי כי פקדיך נצרתי ";

                case 'ח':
                    return "חלקי ה' אמרתי לשמר דבריך \nחליתי פניך בכל לב חנני כאמרתך \nחשבתי דרכי ואשיבה רגלי אל עדתיך " +
                        "\nחשתי ולא התמהמהתי לשמר מצותיך \nחבלי רשעים עודני תורתך לא שכחתי \nחצות לילה אקום להודות לך על משפטי צדקך " +
                        "\nחבר אני לכל אשר יראוך ולשמרי פקודיך \nחסדך ה' מלאה הארץ חקיך למדני ";

                case 'ט':
                    return "טוב עשית עם עבדך ה' כדברך \nטוב טעם ודעת למדני כי במצותיך האמנתי \nטרם אענה אני שגג ועתה אמרתך שמרתי " +
                        "\nטוב אתה ומטיב למדני חקיך \nטפלו עלי שקר זדים אני בכל לב אצר פקודיך \nטפש כחלב לבם אני תורתך שעשעתי " +
                        "\nטוב לי כי עניתי למען אלמד חקיך \nטוב לי תורת פיך מאלפי זהב וכסף ";

                case 'י':
                    return "ידיך עשוני ויכוננוני הבינני ואלמדה מצותיך \nיראיך יראוני וישמחו כי לדברך יחלתי \nידעתי ה' כי צדק משפטיך ואמונה עניתני \n" +
                        "יהי נא חסדך לנחמני כאמרתך לעבדך \nיבאוני רחמיך ואחיה כי תורתך שעשעי " +
                        "\nיבשו זדים כי שקר עותוני אני אשיח בפקודיך \nישובו לי יראיך וידעי עדתיך\nיהי לבי תמים בחקיך למען לא אבוש  ";

                case 'כ':
                    return "כלתה לתשועתך נפשי לדברך יחלתי \nכלו עיני לאמרתך לאמר מתי תנחמני \nכי הייתי כנאד בקיטור חקיך לא שכחתי \n" +
                        "כמה ימי עבדך מתי תעשה ברדפי משפט \nכרו לי זדים שיחות אשר לא כתורתך \nכל מצותיך אמונה שקר רדפוני עזרני " +
                        "\nכמעט כלוני בארץ ואני לא עזבתי פקדיך \nכחסדך חיני ואשמרה עדות פיך ";

                case 'ך':
                    return "כלתה לתשועתך נפשי לדברך יחלתי \nכלו עיני לאמרתך לאמר מתי תנחמני \nכי הייתי כנאד בקיטור חקיך לא שכחתי \n" +
                        "כמה ימי עבדך מתי תעשה ברדפי משפט \nכרו לי זדים שיחות אשר לא כתורתך \nכל מצותיך אמונה שקר רדפוני עזרני " +
                        "\nכמעט כלוני בארץ ואני לא עזבתי פקדיך \nכחסדך חיני ואשמרה עדות פיך "; ;

                case 'ל':
                    return "לעולם ה' דברך נצב בשמים \nלדר ודר אמונתך כוננת ארץ ותעמד \n" +
                        "למשפטיך עמדו היום כי הכל עבדיך \nלולי תורתך שעשעי אז אבדתי בעניי \n" +
                        "לעולם לא אשכח פקודיך כי בם חייתני \nלך אני הושיעני כי פקודיך דרשתי \n" +
                        "לי קוו רשעים לאבדני עדתיך אתבונן \nלכל תכלה ראיתי קץ רחבה מצותך מאד ";

                case 'מ':
                    return "מה אהבתי תורתך כל היום היא שיחתי \nמאיבי תחכמני מצותך כי לעולם היא לי \n" +
                        "מכל מלמדי השכלתי כי עדותיך שיחה לי \nמזקנים אתבונן כי פקודיך נצרתי \n" +
                        "מכל ארח רע כלאתי רגלי למען אשמר דברך \nממשפטיך לא סרתי כי אתה הורתני \n" +
                        "מה נמלצו לחכי אמרתך מדבש לפי \nמפקודיך אתבונן על כן שנאתי כל ארח שקר ";

                case 'ם':
                    return "מה אהבתי תורתך כל היום היא שיחתי \nמאיבי תחכמני מצותך כי לעולם היא לי \n" +
                      "מכל מלמדי השכלתי כי עדותיך שיחה לי \nמזקנים אתבונן כי פקודיך נצרתי \n" +
                      "מכל ארח רע כלאתי רגלי למען אשמר דברך \nממשפטיך לא סרתי כי אתה הורתני \n" +
                      "מה נמלצו לחכי אמרתך מדבש לפי \nמפקודיך אתבונן על כן שנאתי כל ארח שקר ";

                case 'נ':
                    return "נר לרגלי דברך ואור לנתיבתי \nנשבעתי ואקימה לשמר משפטי צדקך \n" +
                        "נעניתי עד מאד ה' חיני כדברך \nנדבות פי רצה נא ה' ומשפטיך למדני \nנפשי בכפי תמיד ותורתך לא שכחתי \n" +
                        "נתנו רשעים פח לי ומפקודיך לא תעיתי \nנחלתי עדותיך לעולם כי ששון לבי המה \nנטיתי לבי לעשות חקיך לעולם עקב ";

                case 'ן':
                    return "נר לרגלי דברך ואור לנתיבתי \nנשבעתי ואקימה לשמר משפטי צדקך \n" +
                         "נעניתי עד מאד ה' חיני כדברך \nנדבות פי רצה נא ה' ומשפטיך למדני \nנפשי בכפי תמיד ותורתך לא שכחתי \n" +
                         "נתנו רשעים פח לי ומפקודיך לא תעיתי \nנחלתי עדותיך לעולם כי ששון לבי המה \nנטיתי לבי לעשות חקיך לעולם עקב ";

                case 'ס':
                    return "סעפים שנאתי ותורתך אהבתי \nסתרי ומגני אתה לדברך יחלתי \nסורו ממני מרעים ואצרה מצות אלהי \n" +
                        "סמכני כאמרתך ואחיה ואל תבישני משברי \nסעדני ואושעה ואשעה בחקיך תמיד \nסלית כל שוגים מחקיך כי שקר תרמיתם \n" +
                        "סגים השבת כל רשעי ארץ לכן אהבתי עדתיך \nסמר מפחדך בשרי וממשפטיך יראתי ";

                case 'ע':
                    return "עשיתי משפט וצדק בל תניחני לעשקי \nערב עבדך לטוב אל יעשקני זדים \nעיני כלו לישועתך ולאמרת צדקך \n" +
                        "עשה עם עבדך כחסדך וחקיך למדני \nעבדך אני הבינני ואדעה עדתיך \nעת לעשות לה' הפרו תורתך \n" +
                        "על כן אהבתי מצותיך מזהב ומפז \nעל כן כל פקודי כל ישרתי כל ארח שקר שנאתי ";

                case 'פ':
                    return "פלאות עדותיך על כן נצרתם נפשי \nפתח דבריך יאיר מבין פתיים \nפי פערתי ואשאפה כי למצותיך יאבתי \n" +
                        "פנה אלי וחנני כמשפט לאהבי שמך \nפעמי הכן באמרתך ואל תשלט בי כל או \nפדני מעשק אדם ואשמרה פקודיך " +
                        "\nפניך האר בעבדך ולמדני את חקיך \nפלגי מים ירדו עיני על לא שמרו תורתך ";

                case 'ף':
                    return "פלאות עדותיך על כן נצרתם נפשי \nפתח דבריך יאיר מבין פתיים \nפי פערתי ואשאפה כי למצותיך יאבתי \n" +
                       "פנה אלי וחנני כמשפט לאהבי שמך \nפעמי הכן באמרתך ואל תשלט בי כל או \nפדני מעשק אדם ואשמרה פקודיך " +
                       "\nפניך האר בעבדך ולמדני את חקיך \nפלגי מים ירדו עיני על לא שמרו תורתך ";

                case 'צ':
                    return "צדיק אתה ה' וישר משפטיך \nצוית צדק עדתיך ואמונה מאד \nצמתתני קנאתי כי שכחו דבריך צרי " +
                        "\nצרופה אמרתך מאד ועבדך אהבה \nצעיר אנכי ונבזה פקדיך לא שכחתי \nצדקתך צדק לעולם ותורתך אמת " +
                        "\nצר ומצוק מצאוני מצותיך שעשעי \nצדק עדותיך לעולם הבינני ואחיה ";

                case 'ץ':
                    return "צדיק אתה ה' וישר משפטיך \nצוית צדק עדתיך ואמונה מאד \nצמתתני קנאתי כי שכחו דבריך צרי " +
                        "\nצרופה אמרתך מאד ועבדך אהבה \nצעיר אנכי ונבזה פקדיך לא שכחתי \nצדקתך צדק לעולם ותורתך אמת " +
                        "\nצר ומצוק מצאוני מצותיך שעשעי \nצדק עדותיך לעולם הבינני ואחיה ";

                case 'ק':
                    return "קראתי בכל לב ענני ה' חקיך אצרה \nקראתיך הושיעני ואשמרה עדתיך \nקדמתי בנשף ואשועה לדברך יחלתי\n" +
                        "קדמו עיני אשמרות לשיח באמרתך \nקולי שמעה כחסדך ה' כמשפטך חיני \nקרבו רדפי זמה מתורתך רחקו " +
                        "\nקרוב אתה ה' וכל מצותיך אמת \nקדם ידעתי מעדתיך כי לעולם יסדתם  ";

                case 'ר':
                    return "ראה עניי וחלצני כי תורתך לא שכחתי \nריבה ריבי וגאלני לאמרתך חיני \n" +
                        "רחוק מרשעים ישועה כי חקיך לא דרשו \nרחמיך רבים ה' כמשפטיך חיני \n" +
                        "רבים רדפי וצרי מעדותיך לא נטיתי \nראיתי בגדים ואתקוטטה אשר אמרתך לא שמרו " +
                        "\nראה כי פקודיך אהבתי ה' כחסדך חיני \nראש דברך אמת ולעולם כל משפט צדקך ";

                case 'ש':
                    return "שרים רדפוני חנם ומדברך פחד לבי\nשש אנכי על אמרתך כמוצא שלל רב \nשקר שנאתי ואתעבה תורתך אהבתי " +
                        "\nשבע ביום הללתיך על משפטי צדקך \nשלום רב לאהבי תורתך ואין למו מכשול \nשברתי לישועתך ה' ומצותיך עשיתי " +
                        "\nשמרה נפשי עדתיך ואהבם מאד \nשמרתי פקודיך ועדתיך כי כל דרכי נגדך  ";

                case 'ת':
                    return "תקרב רנתי לפניך ה' כדברך הבינני \nתבוא תחנתי לפניך כאמרתך הצילני \nתבענה שפתי תהלה כי תלמדני חקיך " +
                        "\nתען לשוני אמרתך כי כל מצותיך צדק \nתהי ידך לעזרני כי פקודיך בחרתי " +
                        "\nתאבתי לישועתך ה' ותורתך שעשעי \nתחי נפשי ותהללך ומשפטך יעזרני \nתעיתי כשה אבד בקש עבדך כי מצותיך לא שכחתי ";

                case ' ':
                    return "\n";

                default:
                    return $"No predetermined paragraph available for letter {letter}.";
            }
        }

        private void nameInput_KeyPress(object sender, KeyPressEventArgs e)
        {
            if (!IsHebrewCharacter(e.KeyChar) && !char.IsWhiteSpace(e.KeyChar) && e.KeyChar != (char)Keys.Back)
            {
                e.Handled = true; // Prevent the character from being entered.
            }
        }

        private bool IsHebrewCharacter(char character)
        {
            // The Unicode range for Hebrew characters is U+05D0 to U+05EA.
            // You can add more ranges or characters as needed.
            return (character >= 0x05D0 && character <= 0x05EA);
        }

        private void richTextBox1_KeyPress(object sender, KeyPressEventArgs e)
        {
            e.Handled = true;
        }

        private void printButton_Click(object sender, EventArgs e)
        {
            PrintDocument printDocument = new PrintDocument();
            printDocument.PrintPage += PrintDocument_PrintPage;

            PrintDialog printDialog = new PrintDialog();
            printDialog.Document = printDocument;

            if (printDialog.ShowDialog() == DialogResult.OK)
            {
                printDocument.Print();
            }
        }

        private void PrintDocument_PrintPage(object sender, PrintPageEventArgs e)
        {
            string textToPrint = richTextBox1.Text;
            Font font = richTextBox1.Font;

            e.Graphics.DrawString(textToPrint, font, Brushes.Black, 100, 100);
        }

        private void checkBox1_CheckedChanged(object sender, EventArgs e)
        {

            if (checkBox1.Checked)
            {
                kra = true;
                string word = "קרע שטן";
                foreach (char letter in word)
                {
                    string kra = getLetter(letter);
                    richTextBox1.AppendText(kra + Environment.NewLine + Environment.NewLine);
                }
            }

            else if (kra == true)
            {
                kra = false;

                if (richTextBox1.Lines.Length == 58)
                {
                    richTextBox1.Clear();
                }

                else if (richTextBox1.Lines.Length > 58)
                {
                    int lineCount = richTextBox1.Lines.Length;

                    int linesToKeep = lineCount - 58;

                    string[] lines = richTextBox1.Lines.Take(linesToKeep).ToArray();
                    richTextBox1.Lines = lines;

                    richTextBox1.AppendText(Environment.NewLine);

                }

            }


        }

        private void button1_Click(object sender, EventArgs e)
        {
            using (helpForm HelpForm = new helpForm())
            {
                HelpForm.ShowDialog();
            }
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            using (helpForm HelpForm = new helpForm())
            {
                HelpForm.ShowDialog();
            }
        }
    }
}